 <h2 style = 'text-align:center;'>REVENUE ANALYSIS</h2>

<h3 style = 'text-align:center;'>Exploratory Data Analysis</h3>

<h4 style = 'text-align:center;'>January 2, 2024</h4>

In [1]:
# !pip install ipython - sql

In [2]:
%load_ext sql

In [3]:
%%sql 
mysql://root:password@localhost/database_name

In [4]:
%%sql

SELECT * 
FROM sales 
LIMIT 5;

 * mysql://root:***@localhost/na
5 rows affected.

[('AB1037', datetime.date(2018, 1, 11), 94128, 'Per Conubia Nostra PC', 'Canada', 'AB', 'Medicine Hat', 'P.O. Box 954, 658 Diam Rd.', 'Can02', 'EM346', 'Garner, Heidi', 'Crosser', 'FLUX', 2015, 4521.0),
 ('AB1090', datetime.date(2018, 4, 5), 94127, 'Nec Diam Associates', 'Canada', 'AB', 'Edmonton', 'P.O. Box 754, 9203 Vulputate St.', 'Can02', 'EM346', 'Garner, Heidi', 'Crosser', 'FLUX', 2015, 4568.0),
 ('AB1095', datetime.date(2018, 4, 9), 94129, 'Per Institute', 'Canada', 'AB', 'Smoky Lake', 'P.O. Box 214, 6024 Donec Avenue', 'Can02', 'EM346', 'Garner, Heidi', 'Minimizer', 'FLUX', 2015, 5130.0),
 ('AB1113', datetime.date(2018, 4, 27), 94122, 'Magna Foundation', 'Canada', 'AB', 'Raymond', 'P.O. Box 706, 9886 Urna. St.', 'Can02', 'EM346', 'Garner, Heidi', 'Crosser', 'FLUX', 2015, 4541.0),
 ('AB1176', datetime.date(2018, 7, 16), 94128, 'Per Conubia Nostra PC', 'Canada', 'AB', 'Medicine Hat', 'P.O. Box 954, 658 Diam Rd.', 'Can02', 'EM346', 'Garner, Heidi', 'Encoder', 'DARO', 2017, 3307.0)]

**1. Total Revenue over the trading period**

In [5]:
%%sql

SELECT 
    FORMAT(SUM(Revenue), 'NO') AS 'Total Revenue'
FROM 
    sales

 * mysql://root:***@localhost/na
1 rows affected.

[('2,078,342',)]

**2. Generated revenue per year of operation:** <br> - Helps to gain valuable insights for long-term financial performance and sustainability of a business

In [6]:
%%sql

SELECT 
    YEAR(SalesDate) AS Year, 
    FORMAT(SUM(Revenue), 'NO') AS 'Total Revenue'
FROM 
    sales
GROUP BY 
    Year
ORDER BY
    Year

 * mysql://root:***@localhost/na
2 rows affected.

[(2017, '686,410'), (2018, '1,391,932')]

**2.1. Drill down and display monthly sales for 2017**

In [7]:
%%sql 

SELECT 
    MONTH(SalesDate) AS Month,
    YEAR(SalesDate) AS Year,
    FORMAT(SUM(Revenue), 'NO') As Revenue
FROM 
    sales
WHERE 
    YEAR(SalesDate) = 2017
GROUP BY 
    Month, Year
ORDER BY 
    Month, Year

 * mysql://root:***@localhost/na
12 rows affected.

[(1, 2017, '55,202'),
 (2, 2017, '39,510'),
 (3, 2017, '71,546'),
 (4, 2017, '54,820'),
 (5, 2017, '98,531'),
 (6, 2017, '50,630'),
 (7, 2017, '36,967'),
 (8, 2017, '49,254'),
 (9, 2017, '68,251'),
 (10, 2017, '87,829'),
 (11, 2017, '61,779'),
 (12, 2017, '12,091')]

**2.2. Drill down and display monthly sales for 2018**

In [8]:
%%sql 

SELECT 
    MONTH(SalesDate) AS Month,
    YEAR(SalesDate) AS Year,
    FORMAT(SUM(Revenue), 'NO') As Revenue
FROM 
    sales
WHERE 
    YEAR(SalesDate) = 2018
GROUP BY 
    Month, Year
ORDER BY 
    Month, Year

 * mysql://root:***@localhost/na
12 rows affected.

[(1, 2018, '83,407'),
 (2, 2018, '140,935'),
 (3, 2018, '55,421'),
 (4, 2018, '158,531'),
 (5, 2018, '135,444'),
 (6, 2018, '155,094'),
 (7, 2018, '140,676'),
 (8, 2018, '110,349'),
 (9, 2018, '101,428'),
 (10, 2018, '136,384'),
 (11, 2018, '101,600'),
 (12, 2018, '72,663')]

**2.3. Drill down monthly sales into daily sales for March 2017**

In [9]:
%%sql

SELECT 
    DAY(SalesDate) AS Day,
    MONTH(SalesDate) AS Month,
    YEAR(SalesDate) AS Year,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales
WHERE 
    MONTH(SalesDate) = 3 AND YEAR(SalesDate) = 2017
GROUP BY
    DAY(SalesDate), MONTH(SalesDate), YEAR(SalesDate)
ORDER BY 
    DAY(SalesDate)

 * mysql://root:***@localhost/na
10 rows affected.

[(2, 3, 2017, '17,552'),
 (8, 3, 2017, '5,157'),
 (15, 3, 2017, '6,849'),
 (16, 3, 2017, '5,891'),
 (17, 3, 2017, '5,887'),
 (23, 3, 2017, '6,404'),
 (24, 3, 2017, '5,147'),
 (29, 3, 2017, '6,402'),
 (30, 3, 2017, '5,875'),
 (31, 3, 2017, '6,382')]

**2.4. Drill down August 2018 sales into daily sales**

In [10]:
%%sql

SELECT 
    DAY(SalesDate) AS Day,
    MONTH(SalesDate) AS Month,
    YEAR(SalesDate) AS Year,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales
WHERE 
    MONTH(SalesDate) = 8 AND YEAR(SalesDate) = 2018
GROUP BY
    DAY(SalesDate), MONTH(SalesDate), YEAR(SalesDate)
ORDER BY 
    DAY(SalesDate)

 * mysql://root:***@localhost/na
13 rows affected.

[(1, 8, 2018, '3,200'),
 (3, 8, 2018, '11,101'),
 (6, 8, 2018, '4,134'),
 (8, 8, 2018, '9,306'),
 (9, 8, 2018, '13,781'),
 (13, 8, 2018, '17,418'),
 (15, 8, 2018, '5,934'),
 (16, 8, 2018, '10,286'),
 (20, 8, 2018, '6,781'),
 (23, 8, 2018, '6,844'),
 (28, 8, 2018, '5,490'),
 (29, 8, 2018, '3,320'),
 (31, 8, 2018, '12,754')]

**2.5 Months with the highest sales in 2017 and 2018**  <br>

I used ROW_NUMBER() window function in the subquery to assign a ranking to each row based on the total sales, basically in an descending order within each year. 

The outer query then filters the results to include only the rows with a ranking of 1. This give the top sales for each year.

In [11]:
%%sql

SELECT 
    Month,
    Year,
    TotalSales
FROM (
    SELECT 
        MONTH(SalesDate) AS Month,
        YEAR(SalesDate) AS Year,
        FORMAT(SUM(Revenue), 'NO') AS TotalSales,
        ROW_NUMBER() OVER (PARTITION BY YEAR(SalesDate) ORDER BY SUM(Revenue) DESC) AS RowNum
    FROM
        sales
    WHERE 
        YEAR(SalesDate) IN (2017, 2018)
    GROUP BY
        MONTH(SalesDate), YEAR(SalesDate)
    ) AS RankedSales
WHERE RowNum = 1;

 * mysql://root:***@localhost/na
2 rows affected.

[(5, 2017, '98,531'), (4, 2018, '158,531')]

**2.6 Months with the lowest sales in 2017 and 2018**

In [12]:
%%sql 

SELECT
    Month,
    Year,
    TotalSales
FROM(
    SELECT 
        MONTH(SalesDate) AS Month,
        YEAR(SalesDate) AS Year,
        FORMAT(SUM(Revenue), 'NO') AS TotalSales,
        ROW_NUMBER() OVER (PARTITION BY YEAR(SalesDate) ORDER BY SUM(Revenue) ASC) AS RowNum
    FROM 
        sales 
    WHERE 
        YEAR(SalesDate) IN (2017, 2018)
    GROUP BY 
        MONTH(SalesDate), YEAR(SalesDate)  
    ) AS RankedSales
WHERE RowNum = 1

 * mysql://root:***@localhost/na
2 rows affected.

[(12, 2017, '12,091'), (3, 2018, '55,421')]

**2.7 Year over Year (YoY) Revenue**

In [13]:
%%sql

SELECT 
    YEAR(SalesDate) AS Year,
    FORMAT(SUM(Revenue), 'NO') AS Revenue,
    FORMAT(LAG(SUM(Revenue)) OVER (ORDER BY YEAR(SalesDate)), 'NO') AS 'Previous Year Revenue'
FROM
    sales
GROUP BY 
    YEAR(SalesDate)
ORDER BY 
    YEAR(SalesDate)

 * mysql://root:***@localhost/na
2 rows affected.

[(2017, '686,410', None), (2018, '1,391,932', '686,410')]

**3. Revenue Per Country**

In [14]:
%%sql 

SELECT 
    Country, 
    FORMAT(SUM(Revenue), 'NO') AS Revenue 
FROM
    sales 
GROUP BY
    Country
ORDER BY 
    Revenue DESC

 * mysql://root:***@localhost/na
2 rows affected.

[('Canada', '465,931'), ('United States', '1,612,411')]

**3.1 Percentage proportion of the total revenue per country**

In [15]:
%%sql

SELECT 
    Country,
    FORMAT(SUM(Revenue), 'NO') AS Revenue,
    ROUND((SUM(Revenue * 100) / SUM(SUM(Revenue)) OVER ()),2) AS '% Revenue'
FROM
     sales
GROUP BY
     Country
ORDER BY Revenue

 * mysql://root:***@localhost/na
2 rows affected.

[('United States', '1,612,411', 77.58), ('Canada', '465,931', 22.42)]

**3.2 Total revenue generated in Canada per year**

In [16]:
%%sql 

SELECT 
    YEAR(SalesDate) AS Year,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM 
    sales 
WHERE 
    Country = 'Canada'
GROUP BY 
    YEAR(SalesDate)
ORDER BY 
    YEAR(SalesDate)

 * mysql://root:***@localhost/na
2 rows affected.

[(2017, '157,974'), (2018, '307,957')]

**3.3 Total revenue generated in United States per year**

In [17]:
%%sql 

SELECT 
    YEAR(SalesDate) AS Year,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales 
WHERE 
    Country = 'United States'
GROUP BY
    YEAR(SalesDate)
ORDER BY 
    YEAR(SalesDate)

 * mysql://root:***@localhost/na
2 rows affected.

[(2017, '528,436'), (2018, '1,083,975')]

**4. Revenue by State**

a) Top five (5) States

In [18]:
%%sql

SELECT 
    Country,
    State,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM sales 
GROUP BY State, Country
ORDER BY SUM(Revenue) DESC
LIMIT 5

 * mysql://root:***@localhost/na
5 rows affected.

[('United States', 'CA', '390,269'),
 ('United States', 'WA', '255,627'),
 ('United States', 'ME', '222,427'),
 ('Canada', 'NU', '90,925'),
 ('Canada', 'MB', '84,153')]

b) Last five states by revenue

In [19]:
%%sql

SELECT
    Country,
    State,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM sales 
GROUP BY Country, State
ORDER BY SUM(Revenue) ASC
LIMIT 5

 * mysql://root:***@localhost/na
5 rows affected.

[('United States', 'TN', '3,920'),
 ('United States', 'DE', '4,080'),
 ('United States', 'MS', '4,591'),
 ('United States', 'AL', '4,867'),
 ('Canada', 'SK', '5,980')]

c) Top five states from United States by revenue

In [20]:
%%sql

SELECT
    Country,
    State,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales 
WHERE
    Country = 'United States'
GROUP BY
    State, Country
ORDER BY 
    SUM(Revenue) DESC
LIMIT 5

 * mysql://root:***@localhost/na
5 rows affected.

[('United States', 'CA', '390,269'),
 ('United States', 'WA', '255,627'),
 ('United States', 'ME', '222,427'),
 ('United States', 'MD', '70,443'),
 ('United States', 'VA', '50,451')]

c) Top five states from Canada by revenue

In [21]:
%%sql

SELECT
    Country,
    State,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales 
WHERE
    Country = 'Canada'
GROUP BY
    State, Country
ORDER BY 
    SUM(Revenue) DESC
LIMIT 5

 * mysql://root:***@localhost/na
5 rows affected.

[('Canada', 'NU', '90,925'),
 ('Canada', 'MB', '84,153'),
 ('Canada', 'NB', '68,627'),
 ('Canada', 'AB', '51,525'),
 ('Canada', 'BC', '46,274')]

**5. Revenue by Company** <br>

a) Top 10 Companies

In [22]:
%%sql 

SELECT 
    Country,
    State, 
    City,
    Company,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales 
GROUP BY
    Country, State, City, Company
ORDER BY 
    SUM(Revenue) DESC
LIMIT 10

 * mysql://root:***@localhost/na
10 rows affected.

[('United States', 'CA', 'Fresno', 'Arcu Consulting', '370,017'),
 ('United States', 'ME', 'Portland', 'Quam Curabitur Foundation', '194,058'),
 ('United States', 'WA', 'Bellevue', 'Lorem Eu Inc.', '185,790'),
 ('United States', 'ME', 'Bangor', 'Nibh Consulting', '28,369'),
 ('Canada', 'NU', 'Cambridge Bay', 'Natoque Penatibus LLC', '28,341'),
 ('United States', 'WA', 'Bellevue', 'Scelerisque Lorem Ipsum LLP', '28,110'),
 ('Canada', 'MB', 'Brandon', 'Tincidunt Tempus Risus Inc.', '26,247'),
 ('United States', 'ID', 'Boise', 'Dis Parturient Montes Limited', '26,244'),
 ('United States', 'UT', 'Salt Lake City', 'Nam Porttitor Scelerisque Consulting', '25,367'),
 ('Canada', 'BC', 'Delta', 'Etiam Bibendum Industries', '25,160')]

b) Last 10 companies by revenue

In [23]:
%%sql 

SELECT 
    Country,
    State, 
    City,
    Company,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales 
GROUP BY
    Country, State, City, Company
ORDER BY 
    SUM(Revenue) ASC
LIMIT 10

 * mysql://root:***@localhost/na
10 rows affected.

[('Canada', 'NU', 'Arviat', 'Blandit Mattis Cras LLC', '3,152'),
 ('United States', 'AR', 'Fayetteville', 'Et Netus Associates', '3,200'),
 ('United States', 'TX', 'Dallas', 'Ornare Placerat Orci Company', '3,207'),
 ('Canada', 'NB', 'Campbellton', 'Ut Nisi Associates', '3,306'),
 ('United States', 'OK', 'Norman', 'Nisi Corp.', '3,342'),
 ('United States', 'MT', 'Butte', 'Et Corporation', '3,404'),
 ('Canada', 'AB', 'Edmonton', 'Neque Tellus Inc.', '3,479'),
 ('United States', 'AZ', 'Tucson', 'Nulla Tempor Augue PC', '3,481'),
 ('United States', 'VA', 'Chesapeake', 'Sed Tortor Integer LLP', '3,569'),
 ('United States', 'IL', 'Rockford', 'Lorem Ipsum LLP', '3,582')]

**6. Revenue by product being sold per year**

In [24]:
%%sql 

SELECT
    YEAR(SalesDate) AS Year,
    ProductName AS Product,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales 
GROUP BY
       YEAR(SalesDate), ProductName
ORDER BY
    Product

 * mysql://root:***@localhost/na
22 rows affected.

[(2018, 'Capacitor', '130,308'),
 (2017, 'Capacitor', '50,026'),
 (2018, 'Crosser', '193,207'),
 (2017, 'Crosser', '85,219'),
 (2018, 'Encoder', '83,145'),
 (2017, 'Encoder', '52,543'),
 (2018, 'Maximizer', '144,862'),
 (2017, 'Maximizer', '64,862'),
 (2018, 'Minimizer', '166,615'),
 (2017, 'Minimizer', '76,046'),
 (2018, 'Optimizer', '162,958'),
 (2017, 'Optimizer', '104,987'),
 (2018, 'Pulse', '102,948'),
 (2017, 'Pulse', '31,269'),
 (2017, 'Rise', '17,473'),
 (2018, 'Rise', '88,015'),
 (2018, 'Tilt', '100,122'),
 (2017, 'Tilt', '39,703'),
 (2017, 'Warper', '108,100'),
 (2018, 'Warper', '140,924'),
 (2018, 'Wobble', '78,828'),
 (2017, 'Wobble', '56,182')]

**7. Revenue by Product Category**

In [25]:
%%sql

SELECT
    ProductName AS Product,
    Category,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales 
GROUP BY
      ProductName, Category
ORDER BY
    Product

 * mysql://root:***@localhost/na
11 rows affected.

[('Capacitor', 'FLUX', '180,334'),
 ('Crosser', 'FLUX', '278,426'),
 ('Encoder', 'DARO', '135,688'),
 ('Maximizer', 'FLUX', '209,724'),
 ('Minimizer', 'FLUX', '242,661'),
 ('Optimizer', 'FLUX', '267,945'),
 ('Pulse', 'KENO', '134,217'),
 ('Rise', 'KENO', '105,488'),
 ('Tilt', 'KENO', '139,825'),
 ('Warper', 'DARO', '249,024'),
 ('Wobble', 'DARO', '135,010')]

In [26]:
%%sql

SELECT
    Category,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales 
GROUP BY
      Category
ORDER BY
    SUM(Revenue) DESC

 * mysql://root:***@localhost/na
3 rows affected.

[('FLUX', '1,179,090'), ('DARO', '519,722'), ('KENO', '379,530')]

**8. Revenue by Year of Release**

In [27]:
%%sql

SELECT
    Released AS 'Year of Release',
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales 
GROUP BY
      Released 
ORDER BY
    SUM(Revenue) DESC

 * mysql://root:***@localhost/na
4 rows affected.

[(2016, '866,518'), (2015, '521,087'), (2018, '449,561'), (2017, '241,176')]

**9. Top 5 Sales Representative**

In [28]:
%%sql

SELECT
    SalesRep AS 'Sales Representative',
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales 
GROUP BY
      SalesRep
ORDER BY
    SUM(Revenue) DESC
LIMIT 5

 * mysql://root:***@localhost/na
5 rows affected.

[('White, Carly', '490,517'),
 ('Payne, Carly', '467,115'),
 ('Klein, George', '345,374'),
 ('Garner, Heidi', '225,714'),
 ('Knapp, Linda', '190,181')]

**9. Last 5 Sales Representative**

In [29]:
%%sql

SELECT
    SalesRep AS 'Sales Representative',
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales 
GROUP BY
      SalesRep
ORDER BY
    SUM(Revenue) ASC
LIMIT 5

 * mysql://root:***@localhost/na
5 rows affected.

[('Valentine, Lewis', '20,640'),
 ('Wheeler, Graham', '36,380'),
 ('Ryan, Frances', '55,878'),
 ('Flores, Madison', '62,204'),
 ('Bowen, Molly', '184,339')]

**11. Sales by Region**

In [30]:
%%sql

SELECT
    Country,
    SalesRegion AS Region,
    FORMAT(SUM(Revenue), 'NO') AS Revenue
FROM
    sales 
GROUP BY
      Country, SalesRegion
ORDER BY
    SUM(Revenue) DESC

 * mysql://root:***@localhost/na
10 rows affected.

[('United States', 'USA02', '490,517'),
 ('United States', 'USA07', '467,115'),
 ('United States', 'USA01', '345,374'),
 ('Canada', 'Can02', '225,714'),
 ('United States', 'USA06', '190,181'),
 ('Canada', 'Can01', '184,339'),
 ('United States', 'USA05', '62,204'),
 ('Canada', 'CAN03', '55,878'),
 ('United States', 'USA04', '36,380'),
 ('United States', 'USA03', '20,640')]